; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	image0 - mode
	image1 - mode
	thermograph3 - mode
	thermograph2 - mode
	infrared4 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument5 infrared4)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph3)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared4)
	(supports instrument7 thermograph2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument8 infrared4)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 infrared4)
	(supports instrument9 thermograph3)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
	(supports instrument10 thermograph3)
	(supports instrument10 infrared4)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph3)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
)
(:goal (and
	(pointing satellite0 Planet11)
	(pointing satellite5 Planet11)
	(have_image Phenomenon5 infrared4)
	(have_image Phenomenon6 image1)
	(have_image Planet7 thermograph3)
	(have_image Star8 thermograph2)
	(have_image Planet9 thermograph2)
	(have_image Planet10 image1)
	(have_image Planet11 thermograph2)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image0)
))

)

; plan
1. (turn_to satellite3 groundstation2 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 11
2. (turn_to satellite2 star0 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star0)
   goals met: 0 of 11
3. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 11
4. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 11
5. (turn_to satellite2 planet11 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet11)
   goals met: 0 of 11
6. (take_image satellite2 planet11 instrument3 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 1 of 11
7. (turn_to satellite2 planet10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet10)
   goals met: 1 of 11
8. (take_image satellite2 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 11
9. (turn_to satellite2 phenomenon6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 11
10. (take_image satellite2 phenomenon6 instrument3 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 11
11. (turn_to satellite2 phenomenon13 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon13)
   goals met: 3 of 11
12. (turn_to satellite0 planet11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet11)
   goals met: 4 of 11
13. (take_image satellite2 phenomenon13 instrument3 image0)
   added: (have_image phenomenon13 image0)
   goals met: 5 of 11
14. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 5 of 11
15. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 5 of 11
16. (turn_to satellite2 planet12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet12)
   goals met: 5 of 11
17. (take_image satellite2 planet12 instrument3 image1)
   added: (have_image planet12 image1)
   goals met: 6 of 11
18. (turn_to satellite2 planet9 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet9)
   goals met: 6 of 11
19. (take_image satellite2 planet9 instrument3 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 7 of 11
20. (turn_to satellite2 star8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star8)
   goals met: 7 of 11
21. (take_image satellite2 star8 instrument3 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 8 of 11
22. (turn_to satellite3 phenomenon5 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon5)
   goals met: 8 of 11
23. (take_image satellite3 phenomenon5 instrument6 infrared4)
   added: (have_image phenomenon5 infrared4)
   goals met: 9 of 11
24. (turn_to satellite3 planet7 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 planet7)
   goals met: 9 of 11
25. (take_image satellite3 planet7 instrument6 thermograph3)
   added: (have_image planet7 thermograph3)
   goals met: 10 of 11
26. (turn_to satellite5 planet11 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 planet11)
   goals met: 11 of 11
